Courses/7140/Lectures/Examples/famous-spec-design.org
# -*- mode: org -*-
# -*- org-export-html-postamble:t; -*-
#+STARTUP:showeverything
#+TITLE: Examples of Spec/Design
#+AUTHOR: Prabhaker Mateti
#+OPTIONS: toc:nil
#+LINK_HOME: ../../
#+LINK_UP: ../../Lectures
#+DESCRIPTION: CS7140 Software Engineering Lecture
#+BIND: org-html-preamble-format (("en" "<a href=\"../../Top/\">CS 7140</a> %d"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2015 &bull; <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a> &bull; %d"))
#+HTML_HEAD: <style> P {text-align: justify} code {font-family: monospace; font-size: 10pt;color: brown;} @media screen {BODY {margin: 10%} }</style>
#+STARTUP:showeverything

* Examples of Spec/Design

1. [[../Specs/spec-examples-small.org][Specs and Designs of Tiny Example Programs]] Tiny.* (1000 lines or less)
   1. Telegram
   2. Tabulate Equations
   3. Condense the List of Numbers
   4. pretty printing
   5. Worms

5. [[../Specs/spec-examples-gameoflife.org][Prospects of Specifying The Game-of-Life]]
6. [[../Specs/spec-examples-dirsync.org][Prospects of Specifying DirSync]]

3. No "Completed" Large/Medium Size Examples are available

4. [[../Specs/spec-examples-large.org][Specifications of SLOC 10000+ Example Programs]]
7. [[../Specs/spec-examples-emacs.org][Prospects of Specifying GNU Emacs]]
8. [[../Specs/spec-examples-linux.org][Prospects of Specifying Linux]]

* JavaCard
1. JavaCard is a subset of Java chosen for small memory, weak-CPU, embedded
   devices.  Widely used in SIM cards and ATM cards.
1. http://code.google.com/p/jcml/  Java Card Specification Language based on JML
1. http://www.javacardforum.org/
1. Erik Poll, Joachim van den Berg, Bart Jacobs, 
   "Specification of the JavaCard API in JML"
   http://cs.ru.nl/E.Poll/papers/cardis00.pdf  Recommended Reading.

* Knuth's Common Words Problem
1. "Given a file of text, and a number k, print the k most common words."
1. Used as an example of Literate Programming
1. Criticized as an example of software development
1. Our interest here:  How to describe its spec + design?
1. Defs of text, words, ...
1. Def of "common" word
1. n-ary Tries, ...
1. Destructive Traversals
2. [[../Examples/Knuth-CWP/][Knuth's Common Words Problem]]


* References

1. Others and Bertrand Meyer, "How Specifications Change and Why You
   Should Care" [[http://arxiv.org/pdf/1211.4775v2.pdf][PDF]] Jan 2013. Required Reading.

1. Donald E. Knuth, "A Solution to the Common Words Problem",
   Communications of the ACM, 1986, search for PDF link.  Knuth is a
   Turing Award winner. Required Reading.

1. Nestor Catano, Tim Wahls, "Executing JML Specifications of Java
   Card Applications: A Case Study", search for PDF Link, 2009.
   Recommended Reading
