Courses/7140/Lectures/Examples/famous-spec-design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Examples of Spec/Design</title>
<!-- 2016-01-31 Sun 21:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CS7140 Software Engineering Lecture"
 />
</head>
<body>
<div id="preamble" class="status">
<a href="../../Top/">CS 7140</a> 
</div>
<div id="content">
<h1 class="title">Examples of Spec/Design</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Examples of Spec/Design</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="../Specs/spec-examples-small.html">Specs and Designs of Tiny Example Programs</a> Tiny.* (1000 lines or less)
<ol class="org-ol">
<li>Telegram
</li>
<li>Tabulate Equations
</li>
<li>Condense the List of Numbers
</li>
<li>pretty printing
</li>
<li>Worms
</li>
</ol>
</li>

<li><a href="../Specs/spec-examples-gameoflife.html">Prospects of Specifying The Game-of-Life</a>
</li>
<li><a href="../Specs/spec-examples-dirsync.html">Prospects of Specifying DirSync</a>
</li>

<li>No "Completed" Large/Medium Size Examples are available
</li>

<li><a href="../Specs/spec-examples-large.html">Specifications of SLOC 10000+ Example Programs</a>
</li>
<li><a href="../Specs/spec-examples-emacs.html">Prospects of Specifying GNU Emacs</a>
</li>
<li><a href="../Specs/spec-examples-linux.html">Prospects of Specifying Linux</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> JavaCard</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>JavaCard is a subset of Java chosen for small memory, weak-CPU, embedded
devices.  Widely used in SIM cards and ATM cards.
</li>
<li><a href="http://code.google.com/p/jcml/">http://code.google.com/p/jcml/</a>  Java Card Specification Language based on JML
</li>
<li><a href="http://www.javacardforum.org/">http://www.javacardforum.org/</a>
</li>
<li>Erik Poll, Joachim van den Berg, Bart Jacobs, 
"Specification of the JavaCard API in JML"
<a href="http://cs.ru.nl/E.Poll/papers/cardis00.pdf">http://cs.ru.nl/E.Poll/papers/cardis00.pdf</a>  Recommended Reading.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Knuth's Common Words Problem</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>"Given a file of text, and a number k, print the k most common words."
</li>
<li>Used as an example of Literate Programming
</li>
<li>Criticized as an example of software development
</li>
<li>Our interest here:  How to describe its spec + design?
</li>
<li>Defs of text, words, &#x2026;
</li>
<li>Def of "common" word
</li>
<li>n-ary Tries, &#x2026;
</li>
<li>Destructive Traversals
</li>
<li><a href="../Examples/Knuth-CWP/">Knuth's Common Words Problem</a>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Others and Bertrand Meyer, "How Specifications Change and Why You
Should Care" <a href="http://arxiv.org/pdf/1211.4775v2.pdf">PDF</a> Jan 2013. Required Reading.
</li>

<li>Donald E. Knuth, "A Solution to the Common Words Problem",
Communications of the ACM, 1986, search for PDF link.  Knuth is a
Turing Award winner. Required Reading.
</li>

<li>Nestor Catano, Tim Wahls, "Executing JML Specifications of Java
Card Applications: A Case Study", search for PDF Link, 2009.
Recommended Reading
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2015 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 
</div>
</body>
</html>
